lib/template_posttax.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://avatax.avalara.com/services">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-7" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username><%= @username %></wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%= @password %></wsse:Password>
            <wsu:Created>2012-03-02T23:41:44.511Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ser:Profile>
         <ser:Name><%= @name %></ser:Name>
         <ser:Client><%= @clientname %></ser:Client>
         <ser:Adapter><%= @adapter %></ser:Adapter>
         <ser:Machine><%= @machine %></ser:Machine>
      </ser:Profile>
   </soapenv:Header>
   <soapenv:Body>
      <ser:PostTax>
         <ser:PostTaxRequest>
            <ser:DocId><%= @docid %></ser:DocId>
            <ser:CompanyCode><%= @companycode %></ser:CompanyCode>
            <ser:DocType><%= @doctype %></ser:DocType>
            <ser:DocCode><%= @doccode %></ser:DocCode>
            <ser:DocDate><%= @docdate %></ser:DocDate>
            <ser:TotalAmount><%= @totalamount %></ser:TotalAmount>
            <ser:TotalTax><%= @totaltax %></ser:TotalTax>
            <ser:HashCode><%= @hashcode %></ser:HashCode>
            <ser:Commit><%= @commit %></ser:Commit>
            <ser:NewDocCode><%= @newdoccode %></ser:NewDocCode>
         </ser:PostTaxRequest>
      </ser:PostTax>
   </soapenv:Body>
</soapenv:Envelope>